// +++ Стоит добавить области

&НаСервере
Процедура КомандаЗагрузитьИсториюНаСервере()
	пОбъект = РеквизитФормыВЗначение("Объект"); 
	пОбъект.ЗагрузитьИсторию();
	// +++ Добавить пробелы после запятой
	ЗначениеВРеквизитФормы(пОбъект,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьИсторию(Команда)
	КомандаЗагрузитьИсториюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КаталогХранилищаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Выберите каталог хранилища'");
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	
	// +++ Добавить пробелы после запятой
	// +++ Кажется, что правильно писать ОбработатьВыборКаталогАХранилища или лучше написать КаталогХранилищаНачалоВыбораЗавершение
	Оповещение = Новый ОписаниеОповещения("ОбработатьВыборКаталогХранилища",ЭтотОбъект);
	ДиалогВыбораФайла.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте 
Процедура ОбработатьВыборКаталогХранилища(ВыбранныйКаталог, ДополнительныеПараметры) Экспорт 
	Если ВыбранныйКаталог = Неопределено Тогда
		Возврат;
	Конецесли; // +++ Здесь и далее не каноничное написание ключевых слов. См. КонецЕсли и Тогда
	Объект.КаталогХранилища = ВыбранныйКаталог[0];
КонецПроцедуры

&НаКлиенте
Процедура ИсторияХранилищаПриАктивизацииСтроки(Элемент)
	УстановитьОтборВТЧ();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборВТЧ()
	пВерсия = 0;
	СтрокаИсторияХранилища = Элементы.ИсторияХранилища.ТекущиеДанные;	
	Если СтрокаИсторияХранилища <> Неопределено тогда
		пВерсия = СтрокаИсторияХранилища.Версия;	
	Конецесли;	
	
	// +++ Возможно, когда ничего не выбрано, стоит показывать весь список без отбора, а не по 0 версии.
	Элементы.ИзмененныеОбъекты.ОтборСтрок = Новый ФиксированнаяСтруктура("Версия", пВерсия);
КонецПроцедуры 

